// src/components/Testimonials.jsx
import React from "react";
import { Swiper, SwiperSlide } from "swiper/react";
import { Navigation, Pagination, Autoplay } from "swiper/modules";
import "swiper/css";
import "swiper/css/navigation";
import "swiper/css/pagination";
import TestimonialCard from "./TestimonialCard";

const testimonialsData = [
  {
    name: "Karima Hasan",
    feedback:
      "نقول إيه ولا إيه، عمّ المجال كله! بسم الله ما شاء الله، بيبقى الواحد مش عايز يسيب السيشن لولا مشاكل النت بتاعي غير إنه مش هنلاقي حد بيناقشنا وبيجاوب على أسئلتنا على حساب وقته. ربنا يبارك بوقتك وعملك ويجعلك ممن يُشار إليهم بالبنان ديناً وخلقاً وعلماً 💗.",
  },
  {
    name: "Yasmin Emad",
    feedback:
      "الشرح كان رائع ما شاء الله انا عندي خلفية عن المجال بس بصراحة استفدت حاجات كثير من حضرتك، كفيت ووفيت في ال HTML واسلوب حضرتك في الشرح بسيط وواضح وطريقتك تخلي الواحد يستوعب بسرعة من غير ملل. شكرا على وقتك ومجهودك معانا وربنا يوفقك دايما 👍🏻🌸",
  },
  {
    name: "Youssef Ramadan",
    feedback:
      "والله شكرا يا هندسة على مجهود حضرتك معانا. الشرح والمعلومات اللي حضرتك بتقدمها مفيدة جدا وواضحة وطريقة شرح حضرتك تسهل علينا الفهم بشكل كبير. وكمان موضوع إن حضرتك بتخلينا نعمل سيرش بنفسنا ده بيخلينا نكتسب معلومات أكتر ونتعود ندور ونعتمد على نفسنا في التعلم. بصراحة حضرتك بتبذل مجهود كبير معانا وربنا يجعله في ميزان حسناتك ونستفيد من كل اللي بتعلمهولنا. ربنا يبارك لحضرتك ويجزيك خير على تعبك معانا.",
  },
  {
    name: "Hager Mahmoud",
    feedback:
      "بصراحة السيشنز معمولة بشكل محترم جدًا وواضح إن في مجهود كبير فيها الرود ماب مخلية الطريق واضح وكل خطوة ماشية بترتيب كده. الميزة كمان إن الشرح بسيط، بس في نفس الوقت بتخلينا نفكر ونعمل سيرش بنفسنا مش مجرد ناخد المعلومة وخلاص. التاسكات بعد كل سيشن دي من أحسن الحاجات اللي اتعملت خصوصا بتنبهنا نركز على فكرة ال clean code مش مجرد تاسك والسلام. ونظام الـ points والمنافسة والرانكينج عامل جو حلو وبيشجع إن الواحد يشتغل أكتر. عمومًا السيستم كله مثالي كل حاجه بتخدم بعضها فحابين نشكرك جدًا.",
  },
  {
    name: "Sara Mohamed",
    feedback:
      "ماشاء بجد شرح حضرتك تحفه مع اني واخده الحاجات دي قبل كده بس فعلا كنت نسياها وحضرتك شرحتها بطريقه خليتها تثبت ومش محتاجه اراجعها تاني فعلا + جزاك الله خيرا وربنا يجعل شرحك في ميزان حسناتك",
  },
  {
    name: "Ali Abusria",
    feedback:
      "المعلومات كويسه جدا جدا وتاسكات البحث كويسه وطريقة الشرح مشاء الله بس لو في PDF هتكون اجمد عشان نقدر نرجع بسرعه لو في حاجة نسينها",
  },
  {
    name: "Youssef Mahmoud",
    feedback:
      "السيشنز اسطوريه بصراحه وشرح حضرتك اكتر من ممتاز بصدق ويقارن بشرح دكاتره الجامعه بل افضل منهم بس فيه شوية مشاكل زي النت لما بيقطع والصوت برضو ساعات بيقطع بس الموضوع محلول غير كده مفيش عيوب وشرحك فعلا اكتر من ممتاز",
  },
  {
    name: "Abdelrahman Mohamed",
    feedback:
      "الصراحه والله العظيم ربنا يبارك في عمرك ياهندسه يارب علي الدوره الجميله دي وان شاء الله الجاي احسن ليك طبعا يارب بجد مش خدنا غير 2 سيشن بس استفدنا حجات كتير اوووي من حضرتك وفي حجات كنا بنخدها ونقول مش مهمه حضرتك بتأكد علي المعلومه ميت مره وربنا يبارك ليك يارب ويزيدك كمان وكمان يارب",
  },
  {
    name: "Alice Bakeer",
    feedback:
      "من لبنان، بدي قلك انو كتير فهمت على شرحك وحضرتك يتنظم وترتب الافكار لا كل شي من اكثر السيشنز يلي استفدت منهن حضرتك بتشرح قصص بالجامعة ما بيعطونا هني بدي اتشكرك على كل جهدك بهيدا الكورس",
  },
  {
    name: "Azab Yousry Azab",
    feedback:
      "الشرح حلو كدا وبيبان حرصك على شرح كل معلومة مفيدة في كل موضوع وكل نقطة بنعدي عليها في السيشن ودا مهم جدا وقرينة اثبات لصدقك في الشرح وتوصيل المعلومة والافادة",
  },
  {
    name: "Fathy Elharty",
    feedback:
      "مهندس بهاء شاهين مش عارف اشكر حضرتك ازاي علي المجهود الرائع الي بتعمله معانا والله سواء من شرح أو مساعده لما بيقف معانا حاجه مش فاهمنها ودايما بتعاملنا معامله الاخوه والشرح بجد تحفه اوي انا خدت مع ناس كتير كورسات بس عمري ما فهمت من اي حد زي ما فهمت من حضرتك والله وغير كدا المعلومات الي خدناها في كتير مقالش عليها ف ربنا يحفظك يا هندسه ويوفقك يارب",
  },
  {
    name: "Zeinap Abdallha",
    feedback:
      "الشرح بسيط ومنظم و ملم بكل المعلومات تقريبا، كانت مشكلة الصوت ف السيشن الأولي ف السيشن التاني انحلت الي حد ما غير كدا كل شي واضح الحمدلله",
  },
  {
    name: "Malak Nasser",
    feedback:
      "هتكلم من وجهة نظر شخص بيحب العمق والبساطة والسلاسة في نفس الوقت فالكورس دا انسب خيار بجد معلومات تلاقي شرح تلاقي تفاصيل تلاقي سلاسة تلاقي بساطة تلاقي..من الآخر اللي نفسك فيه عندنا هتلاقيه",
  },
  {
    name: "Doaa Shehab",
    feedback:
      "حرفيا من احسن واطيب الناس اللي اتعاملت معاهم ف المجال حد شاطر ومحترم جدا متفهم لكل حاجه وطيب وفرفوش اوي 😂♥️",
  },
  {
    name: "Khaled Ahmed",
    feedback:
      "السيشن كانت تحفة بس بغض النظر عن الشرح وانو ممتاز فكرة انك تطبق عملي في السيشن دي لوحدها بتشجع الطلبة وعايز اشكرك على مجهودك في السيشن ملحوظ جدا البرزنتيشن منسقة ومفهومة واقتاحة فرصة للطلبة تسأل عن اي حاجة واقفة معاهم واهتمامك بالصلاة ان احنا ناخد بريك وقت الصلاة كتير من الدكاترة مش بيعمل كده وكمان في حاجات جديدة استفدت منها زي الاختصارات اللي تسهل كتابة الكود عليا اول مرة اعرفها وبس كده شكرا يا بشمهندس ❤️Bahaa Shaheen",
  },
  {
    name: "Manar Elsayed",
    feedback:
      "شرح حضرتك جميل جدا ومبسط يتناسب حتي مع الاشخاص اللي مش لها علاقه بالمجال واكثر حاجه كويسه إنه حضرتك بتتابع وبتبعت فيدباك عن كل حاجه وحتى بتسأل ف دا تحفه بصراحه السيشن اللي فاتت بس كنت حضرتك بتقول حاجات كتير ف نفس ذات الوقت حسيتك بتسابق حالك و زي الفل",
  },
  {
    name: "Shimaa Salah",
    feedback:
      "بصراحه ياهندسه انت كفيت ووفيت ابدعت وانجزت مشاء الله اغلب المعلومات حضرتك بتقولها بناخد كم كبير بس مفهوم وبيوصل على طول بس اتمنى تزدو تطبيقات عملي كتير..شكرا بجد على مجهود حضرتك.",
  },
  {
    name: "Najwan Sayed",
    feedback:
      "بصراحة السيشنز لحد دلوقتي كانت مفيدة جدًا والشرح واضح وبسيط وبيوصل المعلومة بسهولة كمان طريقة عرض المعلومات كانت منظمة وده خلّى المتابعة أسهل شكرًا على مجهود حضرتك المبذول في السيشنز. ولو سرعة الشرح تبقى أبطأ شوية هيبقى أفضل عشان ببقى بجري وأنا بحاول أطبق في وسط الشرح 😅",
  },
  {
    name: "Aalaa Adel",
    feedback:
      "هو الشرح ما شاء الله تحفه وزي الفل وأول مره احس أني مستمتعه وأنا بعمل تاسك وفكره المنافسه دي حلوه اوي هيا اللي بتشجع الواحد بس أنا نفسي بصراحة السيشل تبقي متسجله ونسمعها هيبقي اسهل وزي ما قولتوا فوق نعمل سيشن نتناقش فيها بس غير كده تحفه",
  },
];
export default function Testimonials() {
  return (
    <section className="mt-24 max-w-7xl mx-auto px-6">
      <h2 className="text-3xl font-bold text-center mb-10 text-white">
        What Our Students Say
      </h2>

      <Swiper
        modules={[Navigation, Pagination, Autoplay]}
        centeredSlides={true}
        navigation
        pagination={{ clickable: true }}
        autoplay={{
          delay: 4000,
          disableOnInteraction: false,
        }}
        speed={700}
        loop={true}
        breakpoints={{
          0: { slidesPerView: 1, spaceBetween: 20 },
          768: { slidesPerView: 2, spaceBetween: 30 },
          1024: { slidesPerView: 3, spaceBetween: 40 },
        }}
      >
        {testimonialsData.map((item, index) => (
          <SwiperSlide key={index} className="flex justify-center">
            <TestimonialCard name={item.name} feedback={item.feedback} />
          </SwiperSlide>
        ))}
      </Swiper>
    </section>
  );
}
